Revit 2024 API
Field.SubEntityWriteAccessGranted Method
 Checks whether there is write access to subentities storable in this field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool SubEntityWriteAccessGranted()
Visual Basic
Public Function SubEntityWriteAccessGranted As Boolean
Visual C++
public:
bool SubEntityWriteAccessGranted()
Return Value
 True if subentities are writable.
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace